### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.asmita_s3 will be created
+   resource "aws_s3_bucket" "asmita_s3" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "asmita-bucket-847984534"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Creator" = "asmit gupta"
+           "Name"    = "s3 bucket"
        }
+       tags_all                    = {
+           "Creator" = "asmit gupta"
+           "Name"    = "s3 bucket"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # aws_s3_bucket_policy.s3_policy will be created
+   resource "aws_s3_bucket_policy" "s3_policy" {
+       bucket = "asmita-bucket-847984534"
+       id     = (known after apply)
+       policy = (known after apply)
+       region = "us-east-1"
    }

  # aws_s3_bucket_versioning.versioning will be created
+   resource "aws_s3_bucket_versioning" "versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       region = "us-east-1"

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>